Catalogs/CRM_ПотенциальныеКонтрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>CRM_ПотенциальныеКонтрагенты</Name>
			<Comment>Потенциальные клиенты</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Comment>Вид контрагента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСобственности</Name>
					<Comment>Форма собственности контрагента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Ссылка на организацию для собственных филиалов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Comment>Код ОКПО контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИМНС</Name>
					<Comment>Код ИМНС контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Дополнительная информация о контрагенте</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДС</Name>
					<Comment>Если флажок установлен, то при заполнении приходных документов от этого контрагента, товары будут поступать без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения контактного лица</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Пол контактного лица</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, создавший запись о контрагенте</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПерсональныхДанных</Name>
					<Comment>Согласие на обработку персональных данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтветов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПерсональныхДанныхДата</Name>
					<Comment>Дата согласия на обработку персональных данных</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Имя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Comment>Отчество</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодBCS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласенНаКоммуникацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СемейноеПоложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоМестуРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>Банковский счет контрагента, используемый по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтношений</Name>
					<Comment>Вид отношений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимоотношений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойТелефон</Name>
					<Comment>Основной телефон контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Renault_ВедушийКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставСемьи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родственник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВариантыОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтветов</Name>
			<Comment>используется в правах-настройках пользователей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спрашивать</Name>
					<Comment>Будет открыт диалог на выбор варианта: "Да" - выполнить действие "Нет" - отменить действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
					<Comment>Данное право (настройка) разрешает действие пользователю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
					<Comment>Данное право (настройка) запрещает действие пользователю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодействие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодействие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКвартир.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКвартир</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Квартира</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Офис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бокс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Помещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комната</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/CRM_ПотенциальныеКонтрагенты/Forms/ФормаЭлементаУпрСтарая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Филиал	= ПараметрыСеанса.Организация;
		Объект.Автор	= ПараметрыСеанса.Пользователь;
		Объект.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Спрашивать;
		Объект.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
		Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
		Объект.Пол = Перечисления.ПолФизическихЛиц.НеУказан;
	КонецЕсли;
	
	Если Параметры.Свойство("Наименование") Тогда
		Объект.НаименованиеПолное = Параметры.Наименование;
		Объект.Наименование = Параметры.Наименование;
	КонецЕсли;
	
	Документы.Отбор.Элементы[0].ПравоеЗначение = Объект.Ссылка;
	
	ЗаполнитьКонтакты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЮрФизЛицо();
КонецПроцедуры

&НаКлиенте
Процедура ФормаСобственностиПриИзменении(Элемент)
	УстановитьВидимостьЮрФизЛицо();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЮрФизЛицо()
	
	ЭтоФизлицо = (Объект.ФормаСобственности=ПредопределенноеЗначение("Перечисление.ФормыСобственности.ЧастноеЛицо"));
	Элементы.ФИО.Видимость			= ЭтоФизлицо;
	Элементы.Наименование.Видимость	= НЕ ЭтоФизлицо;
	Элементы.Физлицо.Видимость		= ЭтоФизлицо;
	Элементы.Юрлицо.Видимость		= НЕ ЭтоФизлицо;
	Элементы.ЛичныеДанные.Видимость	= ЭтоФизлицо;
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	
	Объект.Наименование = СокрЛП(Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество);
	
КонецПроцедуры

//Контактная информация
&НаСервере
Процедура ЗаполнитьКонтакты()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	""Поле1="" + КонтактнаяИнформация.Поле1 + ""
	|Поле2="" + КонтактнаяИнформация.Поле2 + ""
	|Поле3="" + КонтактнаяИнформация.Поле3 + ""
	|Поле4="" + КонтактнаяИнформация.Поле4 + ""
	|Поле5="" + КонтактнаяИнформация.Поле5 + ""
	|Поле6="" + КонтактнаяИнформация.Поле6 + ""
	|Поле7="" + КонтактнаяИнформация.Поле7 + ""
	|Поле8="" + КонтактнаяИнформация.Поле8 + ""
	|Поле9="" + КонтактнаяИнформация.Поле9 + ""
	|НаименованиеСтраны="" + (ВЫРАЗИТЬ(КонтактнаяИнформация.Комментарий КАК СТРОКА(500))) + ""
	|Комментарий="" + (ВЫРАЗИТЬ(КонтактнаяИнформация.Комментарий КАК СТРОКА(500))) КАК ЗначенияПолей,
	|	КонтактнаяИнформация.ТипДома,
	|	КонтактнаяИнформация.ТипКорпуса,
	|	КонтактнаяИнформация.ТипКвартиры
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Ссылка";
	Контакты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТипКонтИнф = ТипКонтактнойИнформации(Элементы.Контакты.ТекущиеДанные.Вид);
	Если ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") = ТипКонтИнф Тогда
		ВвестиКонтактнуюИнформацияЧерезФорму("ОбщаяФорма.ВводАдреса")
	ИначеЕсли ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") = ТипКонтИнф Тогда 
		ВвестиКонтактнуюИнформацияЧерезФорму("ОбщаяФорма.ВводТелефона")
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиКонтактнуюИнформацияЧерезФорму(ИмяФормы)
	
	ЗначенияПолей = Renault_УправлениеКонтактнойИнформацией.ПреобразоватьСтрокуВСписокПолей(Элементы.Контакты.ТекущиеДанные.ЗначенияПолей);
	ЗначенияПолей.Добавить(Элементы.Контакты.ТекущиеДанные.ТипДома, "ТипДома");
	ЗначенияПолей.Добавить(Элементы.Контакты.ТекущиеДанные.ТипКорпуса, "ТипКорпуса");
	ЗначенияПолей.Добавить(?(Элементы.Контакты.ТекущиеДанные.ТипКвартиры = ПредопределенноеЗначение("Перечисление.ТипыКвартир.Офис"), "офис", "квартира"), "ТипКвартиры");
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", Объект.Наименование);
	ПараметрыФормы.Вставить("ЗначенияПолей", ЗначенияПолей);
	ПараметрыФормы.Вставить("Вид", Элементы.Контакты.ТекущиеДанные.Вид);
	ПараметрыФормы.Вставить("Представление", Элементы.Контакты.ТекущиеДанные.Представление);
	Форма = ПолучитьФорму(ИмяФормы, ПараметрыФормы, ЭтаФорма);
	Результат = Форма.ОткрытьМодально();
	Если Неопределено <> Результат Тогда
		ТекДанные = Элементы.Контакты.ТекущиеДанные;
		ТекДанные.Представление = Результат.Представление;
		ТекДанные.ЗначенияПолей = Renault_УправлениеКонтактнойИнформацией.ПреобразоватьСписокПолейВСтроку(Результат.ЗначенияПолей);
		ЗаписатьКИ(ТекДанные.Тип, ТекДанные.Вид, Объект.Ссылка, ТекДанные.Представление, ТекДанные.ЗначенияПолей);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипКонтактнойИнформации(ВидКонтИнф)
	
	Если ЗначениеЗаполнено(ВидКонтИнф) Тогда
		Возврат ВидКонтИнф.Тип
	Иначе
		Возврат Перечисления.ТипыКонтактнойИнформации.ПустаяСсылка()
	КонецЕсли
	
КонецФункции

&НаКлиенте
Процедура КонтактнаяИнформацияПредставлениеПриИзменении(Элемент)
	
	Элементы.Контакты.ТекущиеДанные.ЗначенияПолей = "";
	ТекДанные = Элементы.Контакты.ТекущиеДанные;
	ЗаписатьКИ(ТекДанные.Тип, ТекДанные.Вид, Объект.Ссылка, ТекДанные.Представление, ТекДанные.ЗначенияПолей);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактыВидПриИзменении(Элемент)
	
	ТипКИ = ТипКонтактнойИнформации(Элементы.Контакты.ТекущиеДанные.Вид);
	Если НЕ ТипКИ = Элементы.Контакты.ТекущиеДанные.Тип Тогда
		Элементы.Контакты.ТекущиеДанные.Тип = ТипКИ;
		Элементы.Контакты.ТекущиеДанные.Представление = "";
		Элементы.Контакты.ТекущиеДанные.ЗначенияПолей = "";
	КонецЕсли;
	ТекДанные = Элементы.Контакты.ТекущиеДанные;
	ЗаписатьКИ(ТекДанные.Тип, ТекДанные.Вид, Объект.Ссылка, ТекДанные.Представление, ТекДанные.ЗначенияПолей);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактыПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.Контакты.ТекущиеДанные;
	УдалитьКИ(ТекДанные.Тип, ТекДанные.Вид, Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьКИ(Тип, Вид, Ссылка)
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Тип = Тип;
	Менеджер.Вид = Вид;
	Менеджер.Объект = Ссылка;
	Менеджер.Удалить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьКИ(Тип, Вид, Ссылка, Представление, ЗначенияПолей)
	
	Если НЕ ЗначениеЗаполнено(Представление) Тогда
		УдалитьКИ(Тип, Вид, Ссылка);
		Возврат
	КонецЕсли;
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Тип = Тип;
	Менеджер.Вид = Вид;
	Менеджер.Объект = Ссылка;
	Менеджер.Представление = Представление;
	СписокПолей = Renault_УправлениеКонтактнойИнформацией.ПреобразоватьСтрокуВСписокПолей(ЗначенияПолей);
	Для Каждого Поле Из СписокПолей Цикл
		Если НЕ Неопределено = Метаданные.РегистрыСведений.КонтактнаяИнформация.Ресурсы.Найти(Поле.Представление) Тогда
			Менеджер[Поле.Представление] = Поле.Значение;
		КонецЕсли;
		Если Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			Если Поле.Представление = "НаименованиеСтраны" Тогда
				Менеджер.Комментарий = Поле.Значение;
			ИначеЕсли Поле.Представление = "ТипДома" Тогда
				Менеджер.ТипДома = Перечисления.ТипыДомов[Поле.Значение];
			ИначеЕсли Поле.Представление = "ТипКорпуса" Тогда
				Менеджер.ТипКорпуса = Перечисления.ТипыКорпусов[Поле.Значение];
			ИначеЕсли Поле.Представление = "ТипКвартиры" Тогда
				Менеджер.ТипКвартиры = Перечисления.ТипыКвартир[Поле.Значение];
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Менеджер.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда //это новый
		Если Вопрос("Перед добавлением контактной информации клиента нужно сохранить в базе. Продоолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Записать();
		КонецЕсли;
	КонецЕсли;
	Отказ = НЕ ЗначениеЗаполнено(Объект.Ссылка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Изменены данные клиента", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Вопрос("Перед добавлением документов клиента необходимо записать. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
			Возврат
		Иначе
			Записать();
			Документы.Отбор.Элементы[0].ПравоеЗначение = Объект.Ссылка;
			Отказ = НЕ ЗначениеЗаполнено(Объект.Ссылка);
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)
	
	Если Объект.ФормаСобственности = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ЧастноеЛицо") Тогда
		Если ПустаяСтрока(Объект.Фамилия) И ПустаяСтрока(Объект.Имя) И ПустаяСтрока(Объект.Отчество) Тогда
			ОбновитьФИО()
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьФИО()
	
	МассивФИО = CRM_Клиент.ПолучитьМассивФИО(Объект.НаименованиеПолное);
	Объект.Фамилия 		= МассивФИО[0];
	Объект.Имя			= МассивФИО[1];
	Объект.Отчество		= МассивФИО[2];
	Объект.Наименование = СокрЛП(Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество);
	
КонецПроцедуры
